OpenFOAM-2.3.0/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

# create mesh
runApplication blockMesh

# create ignition cells cellSet
runApplication topoSet

runApplication $application

# ----------------------------------------------------------------- end-of-file
